_org_posts/_posts/2020-02-23-using-STL-map.org
#+HTML: ---
#+HTML: title: STL map 이용
#+HTML: tags: STL
#+HTML: ---

** STL map
- unique key를 이용한 key-value pair기반 정렬된 연관 컨테이너이다.
- Map은 일반적으로  red-black tree로 구현된다.


** 이용하기
- map객체에 key, data를 추가하면, key를 기반으로 정렬된다는 의미
- key가 string이라면 사전순 정렬이 된다.
- tree 구조를 표현하기 유리할 듯 싶다.

** 예제 코드1 : int를 key로, string을 가지는 객체의 map
#+BEGIN_SRC cpp
#include <iostream>
#include <map>
#include <string>
using namespace std;

int main(int argc, char* argv[])
{
    // int를 key로, string을 가지는 map 객체 선언
    map <int, string> m; 


    // 3개의 데이터를 추가
    m.insert(make_pair(1, "aaa"));
    m.insert(make_pair(2, "bbb"));
    m.insert(make_pair(3, "ccc"));

    // loop를 돌면서, 출력
    for(map<int, string>::iterator it = m.begin();it!=m.end();it++) {
        cout << it->second <<endl;
    }
    cout << "-----" << endl;
    
    // 배열 형태로 접근하면서, 내용 변경
    m[1] = "AAA";
    m[2] = "BBB";
    m[3] = "CCC";

    // loop를 돌면서, 출력
    for(map<int, string>::iterator it = m.begin();it!=m.end();it++) {
        cout << it->second <<endl;
    }
    return 0;
}
#+END_SRC

** Reference
- https://www.geeksforgeeks.org/map-associative-containers-the-c-standard-template-library-stl/
