_posts_bak/2020-02-23-using-STL-map.html
---
layout: post
title: STL map 이용
tags: STL
---

<div id="outline-container-org98ea895" class="outline-2">
<h2 id="org98ea895">STL map</h2>
<div class="outline-text-2" id="text-org98ea895">
<ul class="org-ul">
<li>unique key를 이용한 key-value pair기반 정렬된 연관 컨테이너이다.</li>
<li>Map은 일반적으로  red-black tree로 구현된다.</li>
</ul>
</div>
</div>


<div id="outline-container-org2470a97" class="outline-2">
<h2 id="org2470a97">이용하기</h2>
<div class="outline-text-2" id="text-org2470a97">
<ul class="org-ul">
<li>map객체에 key, data를 추가하면, key를 기반으로 정렬된다는 의미</li>
<li>key가 string이라면 사전순 정렬이 된다.</li>
<li>tree 구조를 표현하기 유리할 듯 싶다.</li>
</ul>
</div>
</div>

<div id="outline-container-org458e095" class="outline-2">
<h2 id="org458e095">예제 코드1 : int를 key로, string을 가지는 객체의 map</h2>
<div class="outline-text-2" id="text-org458e095">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;iostream&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;map&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;string&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #888a85;">// </span><span style="color: #888a85;">int&#47484; key&#47196;, string&#51012; &#44032;&#51648;&#45716; map &#44061;&#52404; &#49440;&#50616;</span>
    <span style="color: #8ae234; font-weight: bold;">map</span> &lt;<span style="color: #8ae234; font-weight: bold;">int</span>, <span style="color: #8ae234; font-weight: bold;">string</span>&gt; <span style="color: #ff6347;">m</span>; 


    <span style="color: #888a85;">// </span><span style="color: #888a85;">3&#44060;&#51032; &#45936;&#51060;&#53552;&#47484; &#52628;&#44032;</span>
    m.insert(make_pair(1, <span style="color: #ad7fa8; font-style: italic;">"aaa"</span>));
    m.insert(make_pair(2, <span style="color: #ad7fa8; font-style: italic;">"bbb"</span>));
    m.insert(make_pair(3, <span style="color: #ad7fa8; font-style: italic;">"ccc"</span>));

    <span style="color: #888a85;">// </span><span style="color: #888a85;">loop&#47484; &#46028;&#47732;&#49436;, &#52636;&#47141;</span>
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234;">map</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>, <span style="color: #8ae234; font-weight: bold;">string</span>&gt;::<span style="color: #8ae234; font-weight: bold;">iterator</span> <span style="color: #ff6347;">it</span> = m.begin();it!=m.end();it++) {
        cout &lt;&lt; it-&gt;second &lt;&lt;endl;
    }
    cout &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"-----"</span> &lt;&lt; endl;

    <span style="color: #888a85;">// </span><span style="color: #888a85;">&#48176;&#50676; &#54805;&#53468;&#47196; &#51217;&#44540;&#54616;&#47732;&#49436;, &#45236;&#50857; &#48320;&#44221;</span>
    m[1] = <span style="color: #ad7fa8; font-style: italic;">"AAA"</span>;
    m[2] = <span style="color: #ad7fa8; font-style: italic;">"BBB"</span>;
    m[3] = <span style="color: #ad7fa8; font-style: italic;">"CCC"</span>;

    <span style="color: #888a85;">// </span><span style="color: #888a85;">loop&#47484; &#46028;&#47732;&#49436;, &#52636;&#47141;</span>
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234;">map</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>, <span style="color: #8ae234; font-weight: bold;">string</span>&gt;::<span style="color: #8ae234; font-weight: bold;">iterator</span> <span style="color: #ff6347;">it</span> = m.begin();it!=m.end();it++) {
        cout &lt;&lt; it-&gt;second &lt;&lt;endl;
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org454e1fa" class="outline-2">
<h2 id="org454e1fa">Reference</h2>
<div class="outline-text-2" id="text-org454e1fa">
<ul class="org-ul">
<li><a href="https://www.geeksforgeeks.org/map-associative-containers-the-c-standard-template-library-stl/">https://www.geeksforgeeks.org/map-associative-containers-the-c-standard-template-library-stl/</a></li>
</ul>
</div>
</div>
